tap "browsh-org/browsh"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "mongodb/brew"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "adns"
brew "glib"
brew "cairo"
brew "zstd"
brew "libtiff"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "aom"
brew "apr"
brew "apr-util"
brew "argon2"
brew "libssh2"
brew "aria2"
brew "aspell"
brew "at-spi2-core"
brew "autoconf"
brew "automake"
brew "awk"
brew "bash"
brew "bat"
brew "bdw-gc"
brew "bettercap"
brew "json-c"
brew "libunistring"
brew "bind"
brew "gmp"
brew "libraqm"
brew "openblas"
brew "numpy", link: false
brew "p7zip"
brew "pillow"
brew "python@3.11"
brew "binwalk"
brew "bison"
brew "blueutil"
brew "brew-cask-completion"
brew "brightness"
brew "byacc"
brew "carthage"
brew "cffi"
brew "cmake"
brew "unbound"
brew "gnutls"
brew "libssh"
brew "snappy"
brew "qemu"
brew "colima"
brew "coreutils"
brew "cowsay"
brew "csvlens"
brew "curl"
brew "enchant"
brew "entr"
brew "exa"
brew "expect"
brew "feroxbuster"
brew "flac"
brew "lame"
brew "libsndfile"
brew "tesseract"
brew "ffmpeg", link: false
brew "pmix"
brew "open-mpi"
brew "fzf"
brew "libavif"
brew "gd"
brew "gdb"
brew "geckodriver"
brew "gengetopt"
brew "gh"
brew "ghostscript"
brew "gifsicle"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-which"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "goffice"
brew "gnumeric"
brew "gnupg"
brew "go"
brew "go-bindata"
brew "pkg-config"
brew "gobject-introspection"
brew "gobuster"
brew "gpgme"
brew "openjdk"
brew "gradle"
brew "graphviz"
brew "grepcidr"
brew "hashcat"
brew "httpie"
brew "libheif"
brew "python@3.9"
brew "imagemagick"
brew "imlib2"
brew "ipcalc"
brew "ipython"
brew "isort"
brew "john-jumbo"
brew "jpeg"
brew "jq"
brew "keyring", link: false
brew "krb5"
brew "libdnet"
brew "libelf"
brew "libmagic"
brew "libmaxminddb"
brew "libxslt"
brew "lnav"
brew "lolcat"
brew "lua"
brew "mapcidr"
brew "mas"
brew "masscan"
brew "minimodem"
brew "mint"
brew "node"
brew "mongosh"
brew "mp3wrap"
brew "neo4j"
brew "neofetch"
brew "neovim"
brew "net-snmp"
brew "nghttp2"
brew "nmap"
brew "openjdk@11", link: true
brew "openjdk@17"
brew "pandoc"
brew "parallel"
brew "poppler"
brew "pdfgrep"
brew "pdftk-java"
brew "plantuml"
brew "poetry"
brew "py3cairo"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pylint"
brew "python-build"
brew "python-tk@3.9"
brew "python@3.10"
brew "qpdf"
brew "qt"
brew "randomize-lines"
brew "rdesktop"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "rlwrap"
brew "ronn"
brew "scons"
brew "shellcheck"
brew "shfmt"
brew "shodan"
brew "smap"
brew "subversion"
brew "t-rec"
brew "tbb"
brew "telnet"
brew "terminalimageviewer"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "virtualenv", link: false
brew "vlang"
brew "vulkan-extensionlayer"
brew "vulkan-loader"
brew "vulkan-tools"
brew "vulkan-validationlayers"
brew "w3m"
brew "wget"
brew "wireshark", link: false
brew "wpscan"
brew "yafc"
brew "youtube-dl"
brew "zbar"
brew "zsh"
brew "browsh-org/browsh/browsh"
brew "mongodb/brew/mongodb-community"
brew "qmk/qmk/qmk"
cask "1password-cli"
cask "alfred"
cask "anaconda"
cask "appcleaner"
cask "applepi-baker"
cask "arc"
cask "audacity"
cask "azure-data-studio"
cask "balenaetcher"
cask "bettertouchtool"
cask "box-drive"
cask "burp-suite"
cask "chromium"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "fastclicker"
cask "firefox"
cask "font-monaspace"
cask "fpc-laz"
cask "fpc-src-laz"
cask "ghidra"
cask "github"
cask "google-chrome"
cask "hammerspoon"
cask "iterm2"
cask "kap"
cask "karabiner-elements"
cask "keka"
cask "kekaexternalhelper"
cask "krita"
cask "lastpass"
cask "lazarus"
cask "macs-fan-control"
cask "mactex"
cask "meld"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "neo4j"
cask "obs"
cask "obs-virtualcam"
cask "onyx"
cask "orbstack"
cask "pdfpen"
cask "powershell"
cask "qflipper"
cask "qmk-toolbox"
cask "qt-creator"
cask "slack"
cask "snappy"
cask "spotify"
cask "sublime-text"
cask "swiftbar"
cask "temurin"
cask "transmit"
cask "unshaky"
cask "via"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "vmware-fusion"
cask "webex"
cask "wireshark"
cask "xquartz"
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Auto HD FPS for YouTube", id: 1546729687
mas "Be Focused Pro", id: 961632517
mas "Bear", id: 1091189122
mas "Bike", id: 1588292384
mas "com.bandan.Declutter", id: 1574021257
mas "com.kagimacOS.Kagi-Search", id: 1622835804
mas "Dark Reader for Safari", id: 1438243180
mas "Fantastical", id: 975937182
mas "FuzzyTime", id: 950297057
mas "Ghostery – Privacy Ad Blocker", id: 1436953057
mas "GIFfun", id: 1040735952
mas "Gifski", id: 1351639930
mas "GIPHY CAPTURE", id: 668208984
mas "Hand Mirror", id: 1502839586
mas "Hush", id: 1544743900
mas "Ivory", id: 6444602274
mas "Keystroke Pro", id: 1572206224
mas "Magnet", id: 441258766
mas "Microsoft To Do", id: 1274495053
mas "MindNode", id: 1289197285
mas "Monitor", id: 6444381226
mas "Msg Viewer Pro", id: 1019539949
mas "MusicHarbor", id: 1440405750
mas "NepTunes", id: 1006739057
mas "Page Screenshot for Safari", id: 1472715727
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Paste Plain Text", id: 1407015686
mas "Pixelmator Pro", id: 1289583905
mas "Pocket", id: 568494494
mas "Readder", id: 1484944100
mas "Reeder", id: 1529448980
mas "Rerouter", id: 1589151155
mas "Save to Matter", id: 1548677272
mas "Save to Raindrop.io", id: 1549370672
mas "Simplefax", id: 1165017252
mas "Spring", id: 1508706541
mas "StopTheMadness", id: 1376402589
mas "Tampermonkey", id: 1482490089
mas "ToothFairy", id: 1191449274
mas "Tweaks for Reddit", id: 1524828965
mas "Tweetbot", id: 1384080005
mas "Type2Phone", id: 472717129
mas "Vinegar", id: 1591303229
mas "Wipr", id: 1320666476
mas "Xcode", id: 497799835
mas "Xnip", id: 1221250572
mas "xSearch", id: 1579902068
vscode "4tron.stack-overflow-view"
vscode "adpyke.codesnap"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "arcsector.vscode-splunk-search-syntax"
vscode "bat67.markdown-extension-pack"
vscode "bierner.emojisense"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "chunsen.bracket-select"
vscode "clysto.plantuml"
vscode "codezombiech.gitignore"
vscode "csholmq.excel-to-markdown-table"
vscode "dandric.vscode-jq"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "dnicolson.binary-plist"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dotiful.dotfiles-syntax-highlighting"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "flyfly6.terminal-in-status-bar"
vscode "foam.foam-vscode"
vscode "formulahendry.code-runner"
vscode "frhtylcn.pythonsnippets"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "goessner.mdmath"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.mermaid-export"
vscode "gurumukhi.selected-lines-count"
vscode "gydunhn.vsc-essentials"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "ionutvmi.path-autocomplete"
vscode "jamiewoodio.cisco"
vscode "jebbs.markdown-extended"
vscode "jebbs.plantuml"
vscode "jheilingbrunner.vscode-gnupg-tool"
vscode "johnpapa.vscode-peacock"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
vscode "jsynowiec.vscode-insertdatestring"
vscode "marimo-team.vscode-marimo"
vscode "mdickin.markdown-shortcuts"
vscode "mebrahtom.plantumlpreviewer"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mohsen1.prettify-json"
vscode "moshfeu.diff-merge"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-paste-image"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "perkovec.emoji"
vscode "pkief.material-icon-theme"
vscode "qhoekman.language-plantuml"
vscode "rangav.vscode-thunder-client"
vscode "redstonewizard08.gitlab"
vscode "salbert.copy-text"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "skn0tt.markdown-link-expander"
vscode "splunk.splunk"
vscode "starkwang.markdown"
vscode "streetsidesoftware.code-spell-checker"
vscode "stuyk.splunkit"
vscode "telesoho.vscode-markdown-paste-image"
vscode "tenable.vscode-auditlang"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tomoki1207.pdf"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.gitdoc"
vscode "well-ar.plantuml"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "ziyasal.vscode-open-in-github"
